       IDENTIFICATION DIVISION.
       PROGRAM-ID.  ELECTION_ANALYSIS.
       AUTHOR. BERLINFIREWALL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT RESULTS2016 ASSIGN TO '2016_election_county.csv'
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RESULTS2024 ASSIGN TO '2024_election_county.csv'
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION. 
         FD RESULTS2016.
         01 COUNTY-RECORD-2016.
            05 2016-ENTRY PIC X(120).
         FD RESULTS2024.
         01 COUNTY-RECORD-2024.
            05 2024-ENTRY PIC X(120).

       WORKING-STORAGE SECTION.
         01 WS-EOF PIC A(1).
         01 WS-EOF-2024 PIC A(1).
         01 WS-RESULTS-2016.
            05 WS-2016-ENTRY PIC X(120).
         
         01 2016_IDX PIC X(4).
         01 2016_DEMOCRATIC_VOTES PIC X(10).
         01 2016_REPUBLICAN_VOTES PIC X(10).
         01 2016_TOTAL_VOTES PIC X(19).
         01 2016_PERCENT_DEMOCRAT PIC X(14).
         01 2016_PERCENT_REPUBLICAN PIC X(14).
         01 2016_DIFFERENCE PIC X(10).  
         01 2016_STATE PIC X(15).
         01 2016_STATE_ABBR PIC X(15).
         01 2016_COUNTY PIC X(30).
         01 2016_COMBINED_FIPS PIC Z(10).

         01 2024_STATE PIC X(15).
         01 2024_COMBINED_FIPS PIC Z(10).
         01 2024_COUNTY PIC X(30).
         01 2024_REPUBLICAN_VOTES PIC Z(10).
         01 2024_DEMOCRATIC_VOTES PIC Z(10).
         01 2024_TOTAL_VOTES PIC X(10).
         01 2024_DIFFERENCE PIC X(10).
         01 2024_PERCENT_REPUBLICAN PIC X(17).
         01 2024_PERCENT_DEMOCRAT PIC X(17).
         01 2024_PER_POINT_DIFF PIC X(17).

         01 2016_REPUBLICAN_VOTES_CLEANED PIC Z(10).
         01 DEC1 PIC Z(2).
         01 2016_DEMOCRATIC_VOTES_CLEANED PIC Z(10).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN INPUT RESULTS2016.
              PERFORM UNTIL WS-EOF = 'Y'
                 READ RESULTS2016
                    AT END MOVE 'Y' TO WS-EOF
                    NOT AT END PERFORM PARSE-PROCEDURE
                 END-READ
              END-PERFORM.
           CLOSE RESULTS2016.
           
           STOP RUN.
           
       PARSE-PROCEDURE.
           UNSTRING 2016-ENTRY DELIMITED BY "," INTO 
              2016_IDX, 2016_DEMOCRATIC_VOTES, 2016_REPUBLICAN_VOTES, 
              2016_TOTAL_VOTES, 2016_PERCENT_DEMOCRAT, 
              2016_PERCENT_REPUBLICAN, 2016_DIFFERENCE, 2016_STATE,
              2016_COUNTY, 2016_COMBINED_FIPS
           END-UNSTRING.
           MOVE 'N' TO WS-EOF-2024.
           OPEN INPUT RESULTS2024.
              PERFORM UNTIL WS-EOF-2024 = 'Y'
                 READ RESULTS2024
                    AT END MOVE 'Y' TO WS-EOF-2024
                    NOT AT END UNSTRING 2024-ENTRY DELIMITED BY "," INTO 
                       2024_STATE, 2024_COMBINED_FIPS, 2024_COUNTY,
                       2024_REPUBLICAN_VOTES, 2024_DEMOCRATIC_VOTES,
                       2024_TOTAL_VOTES, 2024_DIFFERENCE, 
                       2024_PERCENT_REPUBLICAN 2024_PERCENT_DEMOCRAT,
                       2024_PER_POINT_DIFF
                    END-UNSTRING
                    IF ((FUNCTION LOWER-CASE(2016_STATE) = FUNCTION 
                    LOWER-CASE(2024_STATE)) AND (FUNCTION 
                    LOWER-CASE(2016_COUNTY)) = (FUNCTION 
                    LOWER-CASE(2024_COUNTY)))
                    MOVE 'Y' TO WS-EOF-2024
                    END-IF
                 END-READ
              END-PERFORM.
           CLOSE RESULTS2024.
           PERFORM CLEAN-PROCEDURE.
       
       CLEAN-PROCEDURE.
           UNSTRING 2016_DEMOCRATIC_VOTES DELIMITED BY "."
              INTO 2016_DEMOCRATIC_VOTES_CLEANED, DEC1
           END-UNSTRING
           UNSTRING 2016_REPUBLICAN_VOTES DELIMITED BY "."
              INTO 2016_REPUBLICAN_VOTES_CLEANED, DEC1
           END-UNSTRING
           PERFORM DISPLAY-PROCEDURE.

       DISPLAY-PROCEDURE.
           DISPLAY 'State: '2016_STATE.
           DISPLAY 'County: '2016_COUNTY.
           DISPLAY '2016 Democratic: '2016_DEMOCRATIC_VOTES_CLEANED.
           DISPLAY '2016 Republican: '2016_REPUBLICAN_VOTES_CLEANED.
           DISPLAY '2024 Democratic: '2024_DEMOCRATIC_VOTES.
           DISPLAY '2024 Republican: '2024_REPUBLICAN_VOTES.
           DISPLAY 'Total: '2016_TOTAL_VOTES.
           DISPLAY 'Total: '2024_TOTAL_VOTES.
           DISPLAY '==============================='.
